OpenFOAM-13/tutorials/compressibleVoF/depthCharge2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 1;
    p_rgh       1e5;
    p           1e5;
    T           300;
}

zones
{
    bubble
    {
        type        sphere;
        zoneType    cell;

        centre (0.5 0.5 0);
        radius 0.1;

        values
        {
            alpha.water 0;
            p_rgh       1e6;
            p           1e6;
            T           578;
        }
    }

    air
    {
        type        box;
        zoneType    cell;

        box         (-10 1 -1) (10 10 1);

        values
        {
            alpha.water 0;
        }
    }
}

// ************************************************************************* //
